
## :x: Apply Failed

[CI link](https://github.com/daylight55/terraform-cicd-example/actions/runs/19557974876)



<pre><code>Error: collecting instance settings: couldn&#39;t find resource

  with aws_instance.my_web_app,
  on ec2.tf line 1, in resource &#34;aws_instance&#34; &#34;my_web_app&#34;:
   1: resource &#34;aws_instance&#34; &#34;my_web_app&#34; {

::error::Terraform exited with code 1.</code></pre>

<details><summary>Details (Click me)</summary>

```hcl
random_pet.this: Refreshing state... [id=magical-titmouse]
aws_s3_bucket.example: Refreshing state... [id=example-bucket-magical-titmouse]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place

Terraform will perform the following actions:

  # aws_instance.my_web_app will be created
  + resource "aws_instance" "my_web_app" {
      + ami                                  = "ami-005e54dee72cc1d00"
      + arn                                  = (known after apply)
      + associate_public_ip_address          = (known after apply)
      + availability_zone                    = (known after apply)
      + cpu_core_count                       = (known after apply)
      + cpu_threads_per_core                 = (known after apply)
      + disable_api_stop                     = (known after apply)
      + disable_api_termination              = (known after apply)
      + ebs_optimized                        = (known after apply)
      + get_password_data                    = false
      + host_id                              = (known after apply)
      + host_resource_group_arn              = (known after apply)
      + iam_instance_profile                 = (known after apply)
      + id                                   = (known after apply)
      + instance_initiated_shutdown_behavior = (known after apply)
      + instance_state                       = (known after apply)
      + instance_type                        = "m3.xlarge"
      + ipv6_address_count                   = (known after apply)
      + ipv6_addresses                       = (known after apply)
      + key_name                             = (known after apply)
      + monitoring                           = (known after apply)
      + outpost_arn                          = (known after apply)
      + password_data                        = (known after apply)
      + placement_group                      = (known after apply)
      + placement_partition_number           = (known after apply)
      + primary_network_interface_id         = (known after apply)
      + private_dns                          = (known after apply)
      + private_ip                           = (known after apply)
      + public_dns                           = (known after apply)
      + public_ip                            = (known after apply)
      + secondary_private_ips                = (known after apply)
      + security_groups                      = (known after apply)
      + source_dest_check                    = true
      + subnet_id                            = (known after apply)
      + tags_all                             = {
          + "ManagedBy" = "Terraform"
        }
      + tenancy                              = (known after apply)
      + user_data                            = (known after apply)
      + user_data_base64                     = (known after apply)
      + user_data_replace_on_change          = false
      + vpc_security_group_ids               = (known after apply)

      + capacity_reservation_specification (known after apply)

      + cpu_options (known after apply)

      + ebs_block_device (known after apply)

      + enclave_options (known after apply)

      + ephemeral_block_device (known after apply)

      + maintenance_options (known after apply)

      + metadata_options (known after apply)

      + network_interface (known after apply)

      + private_dns_name_options (known after apply)

      + root_block_device {
          + delete_on_termination = true
          + device_name           = (known after apply)
          + encrypted             = (known after apply)
          + iops                  = (known after apply)
          + kms_key_id            = (known after apply)
          + throughput            = (known after apply)
          + volume_id             = (known after apply)
          + volume_size           = 1000
          + volume_type           = (known after apply)
        }
    }

  # aws_s3_bucket.example will be updated in-place
  ~ resource "aws_s3_bucket" "example" {
        id                          = "example-bucket-magical-titmouse"
      ~ tags                        = {
          + "Region" = "ap-northeast-1"
        }
      ~ tags_all                    = {
          + "Region"    = "ap-northeast-1"
            # (1 unchanged element hidden)
        }
        # (12 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

Plan: 1 to add, 1 to change, 0 to destroy.
aws_instance.my_web_app: Creating...
aws_s3_bucket.example: Modifying... [id=example-bucket-magical-titmouse]
aws_s3_bucket.example: Modifications complete after 3s [id=example-bucket-magical-titmouse]

Error: collecting instance settings: couldn't find resource

  with aws_instance.my_web_app,
  on ec2.tf line 1, in resource "aws_instance" "my_web_app":
   1: resource "aws_instance" "my_web_app" {

::error::Terraform exited with code 1.

```

</details>

<!-- github-comment: {"Command":"apply","JobName":"terraform","PRNumber":5,"Program":"tfcmt","SHA1":"553c845dcad049132d81272b2bbcb7286401fb31","Vars":{},"WorkflowName":"terraform-apply"} -->